In [1]:
### Missing data is common in most data analysis applications.

### Pandas makes workign with missing data painless as possible
### For example, all of the descriptive statistics on pandas objects exclude missing data. 
### Pandas uses NaN(the floating point value) to represent missing data in both floating as well as in non-floating point arrays.
### It is just used as a sentinel that can be easily detected.

### The built-in Python "None" is also treated as NA in object arrays

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series([None, "art", np.nan, "music"])

In [4]:
string_data

0     None
1      art
2      NaN
3    music
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
### Panda's NA representation is not the best option; optimal -- but it is simple and reasonably consistent
### In some ways, it's the best solution, with a good all-around performance characterisitcs and a simple API
### that we could concoct in the absence of a true NA data type or bit pattern in Numpy's data types.

In [7]:
### There are a number of ways by which we can filter out missing data.

s = pd.Series([1, np.nan, 4.5, np.nan, 7])

In [9]:
s

0    1.0
1    NaN
2    4.5
3    NaN
4    7.0
dtype: float64

In [8]:
s.dropna() # to drop Nan

0    1.0
2    4.5
4    7.0
dtype: float64

In [9]:
s

0    1.0
1    NaN
2    4.5
3    NaN
4    7.0
dtype: float64

In [10]:
### As you can see, dropna() can be used to drop na values

In [11]:
### Note:- Instead of using np.nan all the time, we could say "from numpy import nan as NA" and then use NA in these places

In [12]:
### ALternate way of computing the same output through boolean indexing
s[s.notnull()]

0    1.0
2    4.5
4    7.0
dtype: float64

In [13]:
### With DF, this dropping option is a bit more complex.
### You may wanna drop whole rows or columns which are all NA or just those containing any NAs.
### dropna by default drops any row or column that contains a missing value

In [14]:
from numpy import nan as na
df = pd.DataFrame([[1,na,4,6.5], [1,3,4,5], [na,na,na,na]])

In [15]:
df

     0    1    2    3
0  1.0  NaN  4.0  6.5
1  1.0  3.0  4.0  5.0
2  NaN  NaN  NaN  NaN

In [16]:
cleaned = df.dropna()

In [17]:
cleaned

     0    1    2    3
1  1.0  3.0  4.0  5.0

In [18]:
# dropna() drops rows with at least one Nan

In [19]:
### Passing how='all' will only drop rows that are all NA

cleaned_how = df.dropna(how='all')

In [20]:
cleaned_how

     0    1    2    3
0  1.0  NaN  4.0  6.5
1  1.0  3.0  4.0  5.0

Dropping <b>columns </b> in the same way is only a matter of passing axis=1

In [21]:
cleaned_rows = df.dropna(axis=1)

In [22]:
cleaned_rows

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [26]:
### Since all the columns had at least one NA, they were all dropped

In [27]:
cleaned_rows_how = df.dropna(axis=1, how='all')

In [28]:
cleaned_rows_how

     0    1    2    3
0  1.0  NaN  4.0  6.5
1  1.0  3.0  4.0  5.0
2  NaN  NaN  NaN  NaN

In [30]:
df1 = pd.DataFrame(np.random.randn(7,3))

In [31]:
np.random.randn(7,3)

array([[ 0.76135522, -1.8945528 , -0.8260012 ],
       [-0.13848816,  2.11087647,  0.05184591],
       [-0.43535463,  1.69842324,  0.67286004],
       [ 1.16155566,  0.08270315,  1.69122643],
       [ 0.03526244, -0.05379125,  1.97350292],
       [-0.47634714, -0.89020535,  2.48835513],
       [ 0.44961321,  3.1949168 ,  0.66958977]])

In [33]:
df1

          0         1         2
0  0.921845  0.155766 -1.202685
1 -0.742688  0.405190 -0.420736
2 -0.908924  1.312902  2.461489
3  0.512066 -0.468532  1.143857
4  0.907319  1.720278  0.699463
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

Lets assign Nan to all rows between 0 to 3 and and third column

In [35]:
df1.iloc[:3,2] = na

In [36]:
df1

          0         1         2
0  0.921845  0.155766       NaN
1 -0.742688  0.405190       NaN
2 -0.908924  1.312902       NaN
3  0.512066 -0.468532       NaN
4  0.907319  1.720278  0.699463
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

In [37]:
df1.ix[:4,1] = na

In [38]:
df1

          0         1         2
0  0.921845       NaN       NaN
1 -0.742688       NaN       NaN
2 -0.908924       NaN       NaN
3  0.512066       NaN       NaN
4  0.907319       NaN  0.699463
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

In [39]:
### The thresh argument can help us filter out missing values and keep only rows that meet the criterion of minimum number of
### valid observations.

### For example in the DF above, if you wanna show only the rows that have at least 2 valid observations, we do this

df1.dropna(thresh=2)

          0         1         2
4  0.907319       NaN  0.699463
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

In [ ]:
# In above example, only the rows with atleast 2 values in each row remains in the dataframe

In [40]:
### if we say, thersh=3, only the last 2 rows are gonna be displayed

df1.dropna(thresh=3)

          0         1         2
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

In [42]:
### But if you wanna fill in these holes rather blatabtly disregarding other data along with the missing values,
### we may want to employ other techniques.

### fillna is one useful method.

df1.fillna(0)

          0         1         2
0  0.921845  0.000000  0.000000
1 -0.742688  0.000000  0.000000
2 -0.908924  0.000000  0.000000
3  0.512066  0.000000  0.000000
4  0.907319  0.000000  0.699463
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

In [43]:
### Calling fillna with a dict, you can use a different fill value for each column.

In [44]:
df1

          0         1         2
0  0.921845       NaN       NaN
1 -0.742688       NaN       NaN
2 -0.908924       NaN       NaN
3  0.512066       NaN       NaN
4  0.907319       NaN  0.699463
5 -2.396482  0.300868  0.408139
6  0.043696 -1.076782 -0.450186

In [45]:
df2 = pd.DataFrame(np.random.randn(6,3))

In [46]:
df2

          0         1         2
0 -1.303617  0.653964  0.656181
1  1.049583 -1.560446  0.854838
2  1.627874  0.528390  0.286984
3  0.615981  1.223306 -0.238201
4  1.258082 -0.228125 -0.619520
5 -0.419704  0.767812 -0.636126

In [48]:
df2.iloc[3:,1] = na

In [49]:
df2.iloc[4:,2] = na

In [50]:
df2

          0         1         2
0 -1.303617  0.653964  0.656181
1  1.049583 -1.560446  0.854838
2  1.627874  0.528390  0.286984
3  0.615981       NaN -0.238201
4  1.258082       NaN       NaN
5 -0.419704       NaN       NaN

In [51]:
### The same interpolation methods available for reindexing can be used with fillna

df2.fillna(method='ffill')

          0         1         2
0 -1.303617  0.653964  0.656181
1  1.049583 -1.560446  0.854838
2  1.627874  0.528390  0.286984
3  0.615981  0.528390 -0.238201
4  1.258082  0.528390 -0.238201
5 -0.419704  0.528390 -0.238201

In [52]:
### The missing values have been replaced with the last available valid element

In [53]:
### You can also specify a limit for the forward fill.

df2.fillna(method='ffill', limit=2)

          0         1         2
0 -1.303617  0.653964  0.656181
1  1.049583 -1.560446  0.854838
2  1.627874  0.528390  0.286984
3  0.615981  0.528390 -0.238201
4  1.258082  0.528390 -0.238201
5 -0.419704       NaN -0.238201

In [54]:
df2[1]

0    0.653964
1   -1.560446
2    0.528390
3         NaN
4         NaN
5         NaN
Name: 1, dtype: float64

In [55]:
df2[1].mean()

-0.12603049533247498

In [56]:
### You can be a little creative as well, such as filling in the missing values with the mean

In [57]:
df2[1].fillna(df2[1].mean())

0    0.653964
1   -1.560446
2    0.528390
3   -0.126030
4   -0.126030
5   -0.126030
Name: 1, dtype: float64